fpm_golden_runs/fpm_h100_qwen32_tp8_8k1k_pareto_20260624_011804/e2e/bench_c64.log
INFO 06-24 02:07:34 [nixl_utils.py:20] Setting UCX_RCACHE_MAX_UNRELEASED to '1024' to avoid a rare memory leak in UCX when using NIXL.
INFO 06-24 02:07:34 [nixl_utils.py:32] NIXL is available
Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x715da20fca40>, trust_remote_code=False, seed=0, num_prompts=192, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=8192, random_output_len=1024, random_range_ratio='0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai', base_url='http://localhost:8001', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=64, model='Qwen/Qwen3-32B', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='/results', result_filename='e2e_c64.json', ignore_eos=True, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,90,99', goodput=None, request_id_prefix='bench-cb274e55-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 06-24 02:07:36 [utils.py:90] Sampling input_len from [8192, 8192] and output_len from [1024, 1024]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 64
100%|██████████| 192/192 [01:10<00:00,  2.73it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     192       
Failed requests:                         0         
Maximum request concurrency:             64        
Benchmark duration (s):                  70.20     
Total input tokens:                      1572864   
Total generated tokens:                  196608    
Request throughput (req/s):              2.73      
Output token throughput (tok/s):         2800.60   
Peak output token throughput (tok/s):    4769.00   
Peak concurrent requests:                96.00     
Total token throughput (tok/s):          25205.42  
---------------Time to First Token----------------
Mean TTFT (ms):                          2469.18   
Median TTFT (ms):                        1012.65   
P50 TTFT (ms):                           1012.65   
P90 TTFT (ms):                           6217.35   
P99 TTFT (ms):                           7945.30   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          20.03     
Median TPOT (ms):                        18.97     
P50 TPOT (ms):                           18.97     
P90 TPOT (ms):                           24.00     
P99 TPOT (ms):                           24.14     
---------------Inter-token Latency----------------
Mean ITL (ms):                           20.06     
Median ITL (ms):                         13.76     
P50 ITL (ms):                            13.76     
P90 ITL (ms):                            53.97     
P99 ITL (ms):                            62.70     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          22964.59  
Median E2EL (ms):                        22086.96  
P50 E2EL (ms):                           22086.96  
P90 E2EL (ms):                           30749.79  
P99 E2EL (ms):                           32596.06  
==================================================